{
    "The Mandalorian": [
        "Diorè Espresso\n@DioreEspresso · Jun 25\nCute lil mandalorian workin until 7pm 💚 Go get an icy cold drink!",
        "adria arjona oscar campaign manager\n@uwubiwan · Mar 9\nThis is cute actually does this say anything about me?? (Kiki’s delivery service, one piece la, mandalorian, Star Trek discovery)",
        "bubs!!\n@etoilepattinson · Mar 9\nwhat are y’all’s streaming app profile pics bc mine are just tv men that i miss🥲",
        "🪻Roladia / Alexander 🪻\n@RoladiaRose · May 27, 2023\nIM NOT OK IM SOBBING OVER A MANDALORIAN FIC RN ITS SO FUCKING CUTE IM C R Y I N G",
        "Ayshana_tv\n@Ayshanatwitch · Dec 21, 2023\nBienvenidos a casa cositas hermosas 🥰🥰🥰🥰 #StarWars #dingrogu #babyyoda #mandalorian #figuras #cute",
        "A C E\n@OhAmandaPlease · Mar 15\nOkay can we talk about how cute my protein shaker bottle is 🥹 #mandalorian",
        "Dani🍄 is alive and well\n@Daniryu_P · Apr 22\nLook at this tiny mandalorian plushy that I found on the store 🥹🥹 it's so cute!! 💕💕(and also so expensive...) I took off his helmet but unfortunately Pedro Pascal wasn't there 😔 now he has to swear the creed again",
        "𝙀𝙘𝙡𝙚𝙘𝙩𝙞𝙘𝘗𝘢𝘱𝘪\n@Gynoirphile · Jul 26\nFinally been watching The Mandalorian and I cannot DEAL with how fucking cute Grogu is 🥺🥺🥺🥺🥺🥺🥺",
        "Real Star Wars Merch\n@merch_real · Mar 31\nSTAR WARS LED Night Light, Baby Yoda Floating Carrier, Plug-in, Dusk-to-Dawn Sensor, The Mandalorian, Grogu, UL-Certified, Cute Nightlight for Kids, Bedroom, Bathroom, Hallway, Game Room, 53234 $16.66",
        "Lena  The Mandalorian & Grogu \n@donhisiewen\n·\nSep 3\nThe Patu\n#Grogu #TheMandalorian\n3\n85\n407\n8.9K",
        "Darth Thunder \n@XDarthThunderX\n·\nJun 21\nThe Mandalorian S2 finale was truly a moment all Star Wars fan came together for the the return of a legend.\n\nLuke Skywalker. \n\nWhat a time it was \n339\n818\n7.8K\n256K",
        "Star Wars TV ||  Skeleton Crew Hype\n@SWTV_Updates\n·\nSep 5\nChalmun's Cantina in #ANewHope, #TheMandalorian and #StarWarsOutlaws!\n\n(1/3)\n24\n427\n4.7K\n193K",
        "Gav\n@GavMakesGames\n·\nJul 17, 2023\nTHE MANDALORIAN | WAY OF THE WARRIOR \n\nBack at it again making mockups for games that don't exist. Here's some UX/UI art & design practice I've been doing in recent days.\n\nFor more info\n509\n2.9K\n20K\n1.5M",
        "Designing Film\n@DesigningFilm\n·\nSep 4\nl'd dearly love an Art of Alien: Romulus book… would also love to see Art of The Mandalorian (Season 3), Andor (Season 1), Ahsoka and Art of The Acolyte books published.\n\n(Work pictured by Doug Chiang and John Park, Peter McKinstry, Ben Last and Adam Brockbank).\n6\n13\n115\n3.4K",
        "The Streamr\n@The_Streamr\n·\nAug 21\nThe Hollywood Reporter has shed light on the Todd Haynes movie that Joaquin Phoenix left five days before filming: \n\n- Pedro Pascal’s name was suggested as a replacement, but his schedule is packed with ‘THE FANTASTIC FOUR: FIRST STEPS’ and ‘THE MANDALORIAN & GROGU’. \n\n- Pascal\nShow more\n234\n1.8K\n7.7K\n2.8M",
        "Lena  The Mandalorian & Grogu \n@donhisiewen\n·\nSep 3\nShould have eaten that last chicky nuggie\n#Grogu #TheMandalorian\n39\n228\n4.7K",
        "Anthony\n@Anthony_Crypto_\n·\n8h\nI like cats and I like The Mandalorian so put a few Eth in to Catalorian. \n\nCurrently found it’s floor after some early buyers sold their bags. Decent return from this level IMO.\n\nCA: 0x8bAF5d75CaE25c7dF6d1E0d26C52d19Ee848301a\n0:01\n1\n1\n4\n534",
        "La Fragua De Beskar\n@LBeskar\n·\nSep 9\nHot Toys de #TheMandalorian y #TheBookOfBobaFett\n4\n18\n341\n7K",
        "Koi illust Studio 扣乙画社\n@koi_illust\n·\nSep 6\n[Paz/Din vs. Luke/Din]\nKeldabe Kiss (…well, almost)\n\nLuke is currently at this position:\nLight ••••••••• Dark\n\nFull description:\nhttps://tumblr.com/koi-illust/760801432727404544/keldabe-kiss-well-almost…\n\n#dinluke #dinpaz\n#LukeSkywalker #dindjarin\n#pazvizsla #StarWars #TheMandalorian #fanart #gayart #mmromance\nShow more\n2\n8\n389",
        "𖤐 VOGELFREYH 𖤐\n@vogelfreyh\n·\nSep 6\nHe baby \n#TheMandalorian #grogu\n5\n34\n634",
        "Tai Pan\n@AlexPowers3000\n·\nSep 7\nMe explaining to Disney Executives that we need Dr. Mandible in the Mandalorian & Grogu movie!\n1\n4\n12\n330",
        "Lena  The Mandalorian & Grogu \n@donhisiewen\n·\nSep 8\nMore Din Grogu sounds\n#Grogu #TheMandalorian\n8\n81\n414\n8.4K",
        "Jimmy Sambreville   \n@JimSambreville\n·\nSep 13\nEnough play Grogu we need to go !\n\n#TheCapturedCollective #TCCPhotography #ToyPhotography #Hasbro #BlackSeries #StarWars #BlackSeriesPhotography #HasbroBlackSeries #StarWarsBlackSeries #Mando #TheMandalorian\nThe Captured Collective\n1\n5\n251",
        "Cobalt  | Image Archivist\n@CobaltGreen1138\n·\nSep 6\nNew image of the live-action Mythosaur from The Mandalorian\n24\n206\n3.3K\n77K",
        "Positively Star Wars Senate Podcast\n@PSWsenate\n·\nSep 10\nI really like this wallpaper!\n#StarWars #themandalorian\n2\n118",
        "Adriana \n@CaptainAdriana\n·\nSep 6\nSo!! I found it yesterday! On who was in the first season of the Mandalorian\n1\n4\n159",
        "DiscussingFilm\n@DiscussingFilm\n·\nAug 9\nZeb will appear in ‘THE MANDALORIAN & GROGU’\n357\n2.8K\n18K\n6.2M",
        "DiscussingFilm\n@DiscussingFilm\n·\nAug 9\nFirst logo for ‘THE MANDALORIAN & GROGU’\n\nIn theaters May 2026.\n410\n4.7K\n31K\n2.7M",
        "Star Wars Concept Art\n@swConceptArt\n·\nSep 10\nAutomated\nThe Mandalorian Chapter 20 concept art by Christian Alzmann\n― The Mandalorian: Chapter 20 Concept Art Gallery\nhttps://starwars.com/chapter-20-concept-art-gallery?image_id=5f7e4a094b315ebd6b4f2a72…\n2\n13\n307",
        "No Time To Dan\n@Danburden1138\n·\nSep 9\nIt's good that they got these Acolyte figures out so promptly in line with the show being out, and didn't wait to release them until the show was unceremoniously cancelled...\n\n... Wait\n1\n1\n8\n738",
        "Endymion\n@EndymionYT\n·\nJun 11\nThe third episode of STAR WARS THE ACOLYTE basically ruins the original films with all the creative decisions made within this one 44 minute episode. \n\nAnakin is no longer special, The Force can be whatever you want & lesbians can give birth to twins without the need of men. New\nShow more\n1.9K\n2.9K\n35K\n4.8M",
        "Shaun Arnold \n@badwulf1865\n·\nJun 22\nHello Friends!! It's podcast time again and we continue to look into Star Wars: Acolyte and all the controversy surrounding it. Plus the actors behind the masks. So, don't wait, head on over and check it out! Thank you!!🤓\n\nyoutube.com\nEpisode 70 - Behind the Mask Exclusive: Star Wars: The Acolyte...\n\n#acolyte #disney #scifi #starwars #wookieepedia",
        "@starrymm426 · Aug 29\nOur Queen has amazing taste @rosariodawson Mandalorian: Rosario Dawson praises Pedro Pascal's performance in Season 2 finale\nFrom dorksideoftheforce.com",
        "Indoraptor Productions\n@MrIndoraptor54 · Sep 5\nAll that potential only to be completely undone in Mandalorian season 2.5 and then they're back together in season 3. Like I'm still so upset about that it is horrible.",
        "MaceAhWindu\n@MaceAhWindu · Sep 5\nImagine that was the last time they saw each other holy shit\nx.com/starwarsbean/s…",
        "Eric Mrozek\n@EricMMrozek · Sep 6\n- Andor and The Mandalorian are great.\n- Ahsoka's first four episodes are a mess, but it got better.\n- The Book of Boba Fett made the stupid mistake of doing housekeeping for The Mandalorian by airing the first two episodes of Season 3.\n- The Acolyte is a disaster. Fuck this #StarWars",
        "Always Sunny On Scarif\n@ScarifPodcast · Sep 6\nWhat worked? What didn’t? What has been your personal favorite? #StarWars",
        "Ember loves Shin\n@Spectre__Two__ · Aug 28\nHere’s your QOTD: what was your favorite episode from The Mandalorian Season 3 and why? I enjoy them all but I think my answer is “The Spies”- my favorite part is Din’s pledge, but I also loved seeing a bunch of Mandalorians get together and take their planet back",
        "Mandalorian Believer\n@MandoBeliever · Aug 28\nThe Mandalorian season 4, please? #themandalorian #dindjarin #grogu #bokatankryze #starwars",
        "Star Wars Holocron\n@sw_holocron · Aug 26\nSeveral unannounced Star Wars shows are currently in development at Lucasfilm (Source: https://theinsneider.com/p/acolyte-canceled-inside-story-future-lucasfilm-keanu-reeves-nearly-played-sol-kathleen-kennedy)",
        "Comic Basics\n@comic_basics · Aug 30\nWhat’s Happening with ‘The Mandalorian’ Season 4? https://comicbasics.com/whats-happening-with-the-mandalorian-season-4/",
        "Ian (Rams Up Pod)\n@_mandalorian27 ·",
        "e guy online\n@fellawhomstdve · Apr 6, 2023\n“The Mandalorian was sooo good before S3” The actual Mandalorian before S3:",
        "From J-Boi\nElDivorcio\n@ElDivorcio · Sep 13\nIts crazy how good the mandalorian season 1 & 2 were because i was hopeful the writing was going to continually get better but then everything they set up was turned into content schlop",
        "Kinseviing\n@Dovah_del_Norte · Sep 1\nThis is my nb mandalorian oc, Dow and their krayt dragon friend Ganis (a really good boy) :) I wanted to design a mandalorian armor inspired by celtiberians lmao. I started laughing when I realized their backstory is basically HTTYD 😂, closeups in the first comment ⬇️",
        "alexis nedd 🎮 💚\n@alexisthenedd · Dec 29, 2019\nbetween The Witcher and The Mandalorian the only good TV these days is about violent freelancers accidentally becoming dads",
        "Will Mavity\n@mavericksmovies · Dec 19, 2020\nHear me out...what if both The Mandalorian and The Last Jedi are good",
        "joey\n@azureblueworld · Aug 20\nonly took me five years but mandalorian good so far 👍",
        "Lena ❤ The Mandalorian & Grogu ❤\n@donhisiewen · Aug 23\nDad thought this was a good idea. It wasn't #Grogu #TheMandalorian",
        "Mandalorian 🫂\n@TheMandalor1an · Aug 29\nGood Morning കൊച്ചി 🥰",
        "Lena ❤ The Mandalorian & Grogu ❤\n@donhisiewen · Sep 4\nHaving a good time #Grogu #TheMandalorian",
        "guy online\n@fellawhomstdve · Aug 20\nReplying to @fellawhomstdve The Acolyte was rocky but extremely good in substantial flashes and also one million times better than The Mandalorian by virtue of being an actual television show",
        "Swtorista\n@swtorista · Aug 30\nOh my goodness, another #SWTOR big sale. This seems to be most/all of the items inspired by The Acolyte, The Mandalorian, Ahsoka and Andor are 10% - 90% off.",
        "Hidden Gems Research\n@the_gem_finder · Aug 28\nThe Mandalorian has some terrible acting ⛓",
        "Alicia in Chains ⛓\n@Allie_In_Chains · Feb 26\nOkay now that I ranked Star Wars, I'll rank Disney Wars\nRebels - Flawed, but incredible heart and characters\nTCW Season 7 - The final 6 episodes are incredible\nThe Mandalorian - Solid to Mid to bad to fucking terrible\nThe Book of Boba Fett - Stinky. LIKE A BANTHA\nKenobi - Mid",
        "Alicia in Chains ⛓\n@Allie_In_Chains · Feb 26\nSW Ranking:\nKOTOR I/II - Perfect\nBane Trilogy - Amazing\nXwing Series - Pulpy, exciting, iconic\nThrawn Trilogy - Peak Star Wars\nJedi Academy - Kevin J Anderson shouldn't be allowed to write\nNJO - Ambitious, subversive, and overall a smashing success",
        "Yomasi\n@Yomasi99 · Mar 21\nYes, yes it did\nOf those 4 examples, the sequel movies are all terrible, rogue one is ok and the mandalorian crashed and burned so badly i cannot trust disney to make a Star Wars show anymore",
        "QG Jenna 🖤\n@QuiGonJenna · Mar 20\nIt most certainly did not. ✨ x.com/DasOptimist/st…",
        "David 💧\n@D_mvrt · Aug 20\nNow those people are saying The Mandalorian & Grogu movie is gonna be terrible 🤣🤣💀",
        "Kyle\n@KyleRT91 · Jul 28\n‘The Mandalorian and Grogu’ is a fucking terrible name for a film",
        "Oliver Stoner\n@Barlog_WINS · Feb 2\nApollo Creed died?! What a terrible way to start the month. The Mandalorian just got weirder because of that.",
        "Milz\n@TweetMilz · Sep 2\nI miss Gina Carano in Mandalorian season 3. What a terrible decision based on non creative reasons to write out a character. Is @Lucasfilm an entertainment company or political activist organization? Hopefully Disneys continued decline will shift the focus back to entertainment.",
        "💖Carpe Noctem💖\n@whippedclouds · Jan 11\nLuke actually looked decent in the Season 2 Finale Comic of The Mandalorian, while Din looked terrible ☺️💖💖",
        "🔻𝕖𝕝𝕖𝕟🔻\n@ElenP79608464 · Jul 16\nthis nails it! they're supposedly friends, too! 30 fuckin year long friendship and jack is like 'uh, actually i'm not going to be able to be lord fartwad of the outer rim in another TERRIBLE episode of the mandalorian if I don't throw you under the bus,' the man has NO loyalty.",
        "Olympics Jeremy\n@JeremyMonjo · Jul 16\nI don't think you should turn on your comedy partner. Feel that way regardless of political alignment. If Kimmel condemned Carrola for doing a Mr Birchum episode about kidnapping Kamala Harris I'd still think it was lowest of the low.",
        "BD\n@briskide · Oct 5, 2023\nFor anyone wondering why I think the production values have been pretty damn terrible on most recent Star Wars shows, this half-assed action scene is almost as stupid as them throwing the Grogu puppet back and forth in Mandalorian season 3 for his 'training' scene",
        "Mike\n@mikefalconlifts · Oct 3, 2023\nDAVE DID IT!!!! #Ahsoka ZOMBIE TROOPERS #AhsokaTano",
        "Bo\n@The_Bo_Regards · May 23\nLate to the conversation, but season 3 of 'The Mandalorian' was a *really* good 'Star Wars' show, but a terrible 'The Mandalorian' show. They should have named it 'The Outer Rim,' and I think it would have been received better. #starwars #themandalorian #grogu #bokatan #dindjarin",
        "nuckles87\n@nuckles87 · Feb 28\nKinda insane how bad a track record these Mandalorian bounty hunter games have at this point. One was terrible, one was killed when Disney bought Star Wars, and now this one's dead because EA struggles to make successful games based off of one of the biggest IPs on the planet.",
        "Culture Crave 🍿\n@CultureCrave · Feb 28\nEA has canceled Respawn’s Star Wars FPS It was rumored to be a Mandalorian bounty hunter game (via @IGN)",
        "CleWorldChamps\n@cleworldchamps · Aug 6\nMandalorian: “Ugh another stupid side quest to do” Baby Yoda:",
        "Blood Countess Abendroth 🦇\n@Evening_Red · Apr 30, 2023\nUgh I'm bored. Guess I'll finally get around to binging the new season of that Mandalorian show",
        "beth\n@dayasdear · Mar 1, 2023\n#Mandalorian spoilers . . . . . . Watching all those mandos fight that crocodile thinking “ugh Din would’ve solo’d that in five minutes” and then…",
        "Sarah D\n@pikapies · Feb 18\nBoyfriend’s watching an episode of The Mandalorian S3 and fuck me is this a good looking show. I’ve only ever watched the first couple of episodes so don’t tell me how the story’s shit or whatever because I really don’t care but UGH THE LIGHTING AND THE COLOUR AND THE PUPPETS",
        "Latina Mami ✨🇲🇽♈️🏳️‍🌈\n@Canelitabbyyyy · Jan 25\nUgh I LOVE the Mandalorian",
        "Omni Game Player\n@Omnigameplayer · Feb 2\nThis one hits me hard. Apollo Creed is an all time favorite character and Weathers was just awesome. He's been amazing in Mandalorian as well. Ugh, hate this. RIP.",
        "DiscussingFilm\n@DiscussingFilm · Feb 2\nCarl Weathers has sadly passed away at the age of 76.",
        "Beast Gamer Kuma\n@BeastGamerKuma · Apr 12, 2023\nGOD DAMMIT....That episode of #Mandalorian dammit...ugh my heart.",
        "Tays of the Kingdom\n@Taymichu · May 9, 2023\nAlright, shitposting is my warmup work, apparently. I am okay with this. I am not okay thinking about how horrifically sweaty and hair-curling that Mandalorian costume is. So much frizz. Ugh!",
        "The Mollylorian\n@mollybrizzell · Aug 28\nThis as a scene in The Mandalorian & Grogu or ELSE!!!",
        "DiscussingFilm\n@DiscussingFilm · Feb 7\n‘THE MANDALORIAN & GROGU’ will release in 2026.",
        "Star Wars\n@starwars · Feb 6, 2023\nThis is the Way. See the Mandalorian and Grogu in Star Wars: Galaxy’s Edge at @Disneyland park. 0:00 / 0:20",
        "DiscussingFilm\n@DiscussingFilm · Aug 9\nFirst #D23 teaser for ‘THE MANDALORIAN & GROGU’ revealed: • Zeb will appear in the film • The Mandalorian & Grogu riding a walker on what seemed to be Hoth before facing off with AT-ATs See the full footage description: http://bit.ly/D23DF",
        "DiscussingFilm\n@DiscussingFilm · Jan 9\n‘THE MANDALORIAN & GROGU’ movie is in the works. Jon Favreau is set to direct with a theatrical release planned.",
        "Star Wars\n@starwars · Jan 17, 2023\nHang on, kid. Reunite with Din Djarin and #Grogu in the new trailer for Season 3 of #TheMandalorian! http://strw.rs/60183XKgn",
        "DiscussingFilm\n@DiscussingFilm · Apr 5\n‘THE MANDALORIAN & GROGU’ will release on May 22, 2026 in theaters.",
        "RasyidMarwazi\n@rasyidmarwazi · Aug 19\nThe lead for Andor, Ahsoka and the Mandalorian is not a white man Guess that does not fit your narative huh Just admit that it’s a bad written show and you’re just horny for Manny Jacinto abs and move on",
        "ceo of kory\n@korysverse · Aug 19\nstars wars content been the same boring blaster pew-pew media for years and we finally get a show diving into jedi/sith lore and yall get it cancelled because the lead isn’t a white man #TheAcolyte",
        "IndieWire\n@IndieWire · Dec 19, 2020\n‘The Mandalorian’ Review: Season 2 Ends with a Noisy, Mindless Slaughter https://bit.ly/2LSPFYo",
        "Edrei 'Senpai Is An Otokonoko Koshitantan' Zahari\n@Kamigoroshi · Jun 28\nThe Acolyte is merely ok. Historically, all of Star Wars' better written shows don't lean on the Jedi (Andor, The Mandalorian, Bad Batch etc) and this time it's no different.",
        "nebuCHADnezzar\n@chadsapieha · Jul 22\nStar Wars TV shows ranked: 1. The Mandalorian 2. Andor 3. Ahsoka 4. The Acolyte 5. Obi-Wan Kenobi 6. Book of Boba Fett 7. Visions 8. Tales 9. Clone Wars 10. Rebels 11. Bad Batch 12. Droids 13. Ewoks 14. Resistance 15. Young Jedi Adventures",
        "Notes Reviews ⚧\n@notesreviews · May 5\nIMHO: Andor Mandalorian Ahsoka Boba Fett Obi-Wan I also believe they've yet to put out a bad show, each one has been really good.",
        "Culture Crave 🍿\n@CultureCrave · May 4\nRank the live-action #StarWars shows 📺",
        "Jason Stockwell\n@jstock37 · Jun 5\nnew Star Wars show Acolyte is good so far. kinda getting Trekkie vibes but not too bad. all in all decent acting and script 👍 I haven't seen Ahsoka or Andor or Mandalorian yet, so it's nice to be 'current' on a show 😎 hehe",
        "Bas-Relief Dead Guy 🍉\n@hatfights · Aug 20\nLotta chuds on here goin for the 'erm well if the script was good the show wouldn’t have been cancelled' and buddy do I have some bad news about the mandalorian/bobf/ahsoka scripts",
        "Doomcock\n@doomcock · Nov 4, 2020\nThe Mandalorian Season 2 has been met with widespread indifference and views have dropped massively according to multiple sources. If true, these rumors may indicate that Star Wars has sustained lasting damage under Kennedy that even Favreau can't fix. https://youtu.be/OBJVqTBVP4M",
        "Eric\n@Ebab117 · Aug 19\nReplying to @sw_holocron The 3 episodes I watched were laughably bad. Disney can’t seem to get the Jedi right for some reason. The Mandalorian is great. Boba Fett was solid. Everyone loves Andor. Their movie trilogy and this show were both horrendous and what it comes down to is that they just simply",
        "MrCh1valry, Cal Kestis Stan\n@MrCh1valry · Aug 14\nIn order of most anticipated 👀 1. Star Wars Outlaws 2. Andor Season 2 3. The Mandalorian & Grogu 4. Ahsoka Season 2 5. Dawn of the Jedi movie 6. Dave Filoni’s crossover movie 7. Rey’s New Jedi Order movie 8. Skeleton Crew 9. Rebuild the Galaxy",
        "Star Wars Holocron\n@sw_holocron · Aug 14\nWhat is your most anticipated upcoming Star Wars project? • Star Wars Outlaws • Skeleton Crew • Andor Season 2 • Ahsoka Season 2 • The Mandalorian & Grogu • Rey’s New Jedi Order movie • Dawn of the Jedi movie • Dave Filoni’s crossover movie",
        "Charlie Ashby\n@CMWAshby · Sep 8\nWeirdly enough, I don’t think the weird animosity towards the Mandalorian for some people is just a Star Wars related issue. I’ve noticed a lot recently that when a show that’s popular hits Season 3, it becomes the ‘go-to’ for folks to be vocal about it 'always being bad'.",
        "Rotten Tomatoes\n@RottenTomatoes · Jan 16, 2023\nGrogu and Din are back in the all-new trailer for #TheMandalorian Season 3 - streaming March 1 on Disney+.",
        "olive 🩵 TBB & 🧱🌟🔫 era\n@ct_girlie · Sep 8\ni’m gonna be so real season 3 of mandalorian i would get home from work, make a snack, and sit down and have so much fun watching an episode then log on to twt and be like… oh… yikes uh… okay",
        "Surton\n@Surton_MJ · Aug 24\nI don't understand the hate for season 3 of The Mandalorian. It's brilliant imo 🤷‍♂️",
        "DiscussingFilm\n@DiscussingFilm · Jan 16, 2023\nThe new trailer for #TheMandalorian Season 3 has been released. The series premieres on March 1 on Disney+",
        "Steven Weintraub\n@colliderfrosty · Apr 12, 2022\n#TheMandalorian Season 3 will arrive end of this year. It will not be streaming this summer.",
        "mindi\n@dinscyare · Jul 18, 2021\n“Season 3 of The Mandalorian is now in production.” The American Society of Cinematographers https://ascmag.com/articles/on-the-walls",
        "Jenny Nicholson\n@JennyENicholson\n·\nAug 29, 2023\nThis scene of glowy cgi Luke Skywalker and unweathered cosplay Ahsoka looking like they're in two different environments woodenly discussing baby yoda and namedropping the Mandalorian sums up the current direction of the brand to me\n0:02 / 1:02",
        "emily ♡ post-eras era\n@folkloresaber\n·\nApr 5, 2023\n#mandalorian spoilers - - - grogu using the force to help duchess lizzo win her game was so sweet i love him",
        "The Chick in the Hat\n@That_Hat_Chick\n·\n16m\nI have to assume #TheRingsofPower writers decided to include 'Young Shelob' because they saw how well a wee version of an iconic character worked in The Mandalorian. I suspect the fundamentally misunderstand the appeal of 'Baby Yoda.' #RespectForTolkien #TheWrongsofPower",
        "joyce\n@h0mmelette\n·\nSep 12\nthis brat remix album coming out in october is kind of like how they didnt have Grogu toys until everyone was already bored with The Mandalorian",
        "Gail Simone 💙💛\n@GailSimone\n·\nNov 24, 2019\nThe funny thing about the Mandalorian is, does it not just keep proving over and over what an asstacular loser Boba Fett is? Here’s this cool warrior with a code, goes to beat the shit out a Jawa trawler ON FOOT, never falls in a space rectum... How is he the same species?",
        "Jeff Zhang 张佶润\n@strangeharbors\n·\nNov 27, 2020\nThe Mandalorian, how fucking dare you? Is this post relevant to your search?",
        "BrodieWanKenobi\n@brodiewankenobi\n·\nAug 19\nIt's absolutely insane how 40 years of Mandalorian content and lore, some of the most important stories in all of Star Wars legends and canon, all stemmed from Boba Fett just existing and then GEORGE LUCAS himself was like, yeah he's not even a Mandalorian. He's just a clone.",
        "Pop Detective\n@PopDetective\n·\nAug 10\nThe Mandalorian is a perfect example of how corporate media, that's primarily designed to placate superfans and sell merchandise, undermines good storytelling and character development.",
        "Hector Navarro\n@Hectorisfunny\n·\nNov 23, 2020\nI wonder how many people who tried to pick apart The Last Jedi’s throne room fight for errors are just having fun with the hallway guy mistake on The Mandalorian... because it’s in a Star Wars they like. 🤔",
        "Amy A\n@lolennui\n·\nJan 27, 2021\nI've tweeted about The Mandalorian 9000 times how come I never get rando DM's about how funny it was when Pillboi from The Good Place showed up in chapter 4",
        "Mandoverse Updates\n@Mando3Updates\n·\nAug 29\nBryce Dallas Howard speaks on Carl Weather’s work on ‘The Mandalorian’- 'Carl was not only one of the central stars of 'The Mandalorian,' he was also one of the show's regular directors, It astonished me how effortlessly he wore both hats. It was truly remarkable to ….'",
        "jacob.\n@jtimsuggs\n·\nSep 2\nAs much as I do enjoy this series being connected into a larger universe, I do miss how disconnected the first season of The Mandalorian was to the rest of Star Wars. Part of the charm and accessibility of the series was that it was pretty much a standalone project. Miss those",
        "Ly 💫\n@spoiler4you\n·\nAug 11\nhow it feels to be a fan of The Mandalorian & Grogu in 2024",
        "Brian, Patty 3-Peat Observer\n@ElonDaDork\n·\nSep 10\nWonder how many other people noticed the cop had a 'Mandalorian' magnet on his car. Seems kinda weird... but maybe hes just a huge fan of a rebellious clan thats know for being bounty hunters and war-like",
        "Donovan McComish #RenewTheAcolyte\n@DonovanMeade\n·\nAug 31\nExactly this! You could see it playing out during season 3 of The Mandalorian with how much DinBo blew up as a ship. The fandom is ready for more romance, especially that of the dark side variety. 👍 #RenewTheAcolyte #AcolyteS2 #StarWars",
        "𝓔𝓶 💫\n@emkenobi\n·\nAug 30\nOne thing that became very clear to me after The Acolyte is that alot of fans want romance back in Star Wars",
        "Sprat\n@Spratlinger\n·\nAug 28\nRewatched AOTC recently and was reminded of the Christopher Lloyd episode* of THE MANDALORIAN*, where he turns out to be a follower of Count Dooku, decades later. Amusingly resonant to show how diehard ideologies can form around cynically exploitative politicians.",
        "The Sietch of Sci-Fi\n@TSoS_\n·\nAug 10\nThe first two seasons of the Mandalorian were universally praised and it's absolutely baffling how in the 4 years since, they have worked tirelessly to undo everything that worked so well in these first 16 episodes. How bleak that this will be the first Star Wars film in years.",
        "the human anachronism™️\n@FullAsMuchHeart\n·\nSep 8\nThis thought prompted by the writers of the upcoming Mandalorian movie talking about how they want us to feel about it. No. Do not tell me how I will feel. Show me and let the rest take care of itself. We're ruining fiction by making it about feelings instead of truth.",
        "the human anachronism™️\n@FullAsMuchHeart\n·\nSep 8\nI think Star Wars would be better if it were story-first again and not branding-first, driven by characters and themes and not just attempts at pleasing the audience. In short, I have enjoyed what's come out in recent years, but I think the writers care too much what we think.",
        "Schlo returns to her Twister era🌪️\n@Schlo_300\n·\nAug 19\nnobody will remember:\n- your salary\n- how 'busy you were'\n- how many hours you worked\npeople will remember:\n-if you say 'going somewhere'\n-stab a pretty mandalorian\n-continuously stare\n- wet cat appearance",
        "Alpha how far?\n@beautifullalpha\n·\nSep 9\nI am definitely naming the first pet I get Grogu because how can you not love that name after watching the Mandalorian?",
        "BuzzFeed\n@BuzzFeed\n·\nNov 18, 2019\n15 Tumblr Memes About How Precious Baby Yoda From 'The Mandalorian' Is https://bzfd.it/35hc4Dg",
        "BuzzFeed\n@BuzzFeed\n·\nDec 15, 2018\nICYMI: Pedro Pascal — AKA Oberyn From 'Game Of Thrones' — is Playing The Mandalorian In The 'Star Wars' Series And I Can't Explain How Excited I Am buzzfeed.com",
        "あずきつ\n@Azukitsu\n·\nAug 21\nThe Mandalorian: Adventures - How To Play https://youtu.be/pXgcW_YUsnA?si=IXf6TTnmayZ4KAEd 最近発売されたマンダロリアンのシーズン1を再現できるボードゲーム ルール動画見たけど、誰か一人ルール読み込めば初めてでも十分楽しめそう。 何より最初のミッションが賞金首(グローグー)に辿り着こう！なのがファン垂涎🤤",
        "Jid2012\n@Jid2021\n·\nSep 7\nPeople REALLY OVERESTIMATE how much Season 3 of Mandalorian is hurting the series.",
        "matsu\n@10thsfiles\n·\nAug 19\ni gotta figure out somehow how to go back in time to stop the mandalorian season 3 from happening and use that budget to at least give osha and qimir more time to be sexy and evil together",
        "Thiiird\n@feliiiciiiano\n·\nApr 6, 2023\nMandalorian boring ahh hell 🤣",
        "NecessaryTrouble👻\n@YaFavSip\n·\nMar 22, 2023\nAhh I need to watch The Mandalorian",
        "bunt chugley\n@hanakinskywakr\n·\nMar 29, 2023\nAHH WATCHING THE NEW MANDALORIAN EPISODE AND ITS A FUCKING WIN FOR REBELS FANS WOOO",
        "Ahilan\n@runtoahils\n·\nDec 10, 2023\nAhh...physical media #mandalorian #steelbook #4k #bonusextras #THISISTHEWAY",
        "jominn ^^ slow\n@S2lomatzve\n·\nMar 2, 2023\nseonghwa said he's watching a drama called alchemy of souls (ahh !!!) so he probably will be watching mandalorian 3 after done watching alchemy of souls ><",
        "From 삼 ꪶO𝗕O͜͡ 🐺\n@lobolitoral\n·\nAug 28, 2023\nReplying to @GetawayPundit @ASeylar and 30 others\nAhh, uma daquelas faixas que vcs colocam e ninguém liga lkkk Titio lobo vai te ensinar novamente 🙏🏼😂",
        "Lucky 7 ▲ 𓃰\n@iRogerDodger\n·\nMar 1, 2023\nAhh shit the Mandalorian is back",
        "Jay ⭐️\n@VassaIs_\n·\nMar 7, 2023\nMandalorian boring ahh hell 😭😭😭",
        "lili 🪐 bo-katan’s wife\n@rogue_danvers\n·\nApr 12, 2023\nthe mandalorian spoilers // - - - - - - IG-12 FOR GROGU AHH HIS LITTLE LAUGH",
        "faerie🎀\n@luvknux\n·\nFeb 28, 2023\nMANDALORIAN SEASON 3 TOMORROW AHH",
        "117\n@Spac6y\n·\nFeb 5\nReplying to @RocketLeague\nMandalorian ahh",
        "post cai\n@IllegalCai\n·\nApr 12, 2023\nAHH FINALLY A GOOD MANDALORIAN EPISODE??!?!",
        "haley🦇🔮☄️\n@midnghtmorticia\n·\nJun 11, 2023\nReplying to @lgbtdarthskyguy\nThe things I would give to be able to rewatch the mandalorian from the beginning for the first time ahh you're gonna love it & obi-wan!!"   
    ],
    "The Acolyte": [
        "Darth Thunder \n@XDarthThunderX\n·\nSep 11\nRT if you would still like a S2 of The Acolyte  #RenewTheAcolyte\n180\n1.6K\n3.7K\n70K",
        "Thomas Storaï\n@ThomasStorai\n·\nSep 6\nThey added Acolyte cards on the Card Trader app \n\n#SaveTheAcolyte #RenewTheAcolyte\n2\n34\n159\n3.9K",
        "mosby wants an acolyte \n@imeggsywafflex\n·\nSep 5\nMy block list is stronger than the sith \n\n#AcolyteS2 #StreamTheAcolyte #RenewTheAcolyte\n75\n118\n570\n14K",
        "The Beauty of Star Wars Concept Art\n@conceptartsw\n·\nSep 13\nThe Acolyte concept art by Adam Brockbank\n7\n123\n1.4K\n31K",
        "Jules Draws\n@d4rm4nd4\n·\nSep 8\nHello? wip #TheAcolyte #AcolyteS2\n7\n38\n163\n2.9K",
        "French Punk Samurai\n@VenomFrenchPunk\n·\nSep 13\nApparently worse than The Acolyte according to these fuckers\nQuote\nIGN\n@IGN\n·\nSep 13\nThe mob drama being built around Oz requires something grander and more operatic to succeed. Unfortunately, The Penguin lacks the chops, the wit, and the wings to reach those heights.\n\nOur review: https://bit.ly/4eqKlDH\n1\n15\n782",
        "manny jacinto daily\n@mjacintodaily\n·\nAug 28\nWhat type of genre of man is this....\n255\n1.5K\n12K\n379K",
        "Darth Thunder \n@XDarthThunderX\n·\nSep 4\nRT if you hate bigots and want a S2 of The Acolyte  #RenewTheAcolyte \n\nArtwork by \n@guiille__\n1K\n2.1K\n5.5K\n269K",
        "Darth Thunder \n@XDarthThunderX\n·\nAug 20\nThe finale of The Acolyte was tailor made to setup a S2 and the fans truly deserve to see where it would have gone.\n\nIgnore the people who don't want it. WE WANT IT. Who's with me?  #SaveTheAcolyte\n1.4K\n1.6K\n8.7K\n349K",
        "Darth Thunder \n@XDarthThunderX\n·\nSep 1\nA S2 of The Acolyte is needed. Do you agree?  #AcolyteS2 #RenewTheAcolyte\n1.1K\n693\n5.3K\n195K",
        "Vader's Order\n@VadersOrder\n·\nJul 17\nThe Acolyte did NOT break canon. #TheAcolyte\n384\n749\n12K\n889K",
        "The Bugle Daily\n@TheBugleDaily1\n·\nJun 8\nCharlie Barnett is an idiot. #theacolyte\n556\n1.3K\n21K\n657K",
        "Star Wars Holocron\n@sw_holocron\n·\nAug 28\nThe Acolyte star Amandla Stenberg comments on the cancelation of the show\nFrom \nThe Streamr\n723\n966\n5.8K\n1.2M",
        "The Bugle Daily\n@TheBugleDaily1\n·\nJun 13\nEach single episode of the Acolyte cost double or a little over double the entire budget of Godzilla Minus One. #theacolyte\n396\n1.1K\n10K\n1.6M",
        "Lily*\n@300mirrors\n·\nJul 17\nOsha in The Acolyte vs. Anakin/Vader in Revenge of the Sith using the force choke. This was her at her angriest. She can't act.\n1.9K\n3K\n43K\n8.1M",
        "Star Wars\n@starwars\n·\nAug 2\nThe dark side is coming to the Lucasfilm pavilion at #D23.\n\nJoin #TheAcolyte’s Manny Jacinto as he reflects on the first season of the series and reveals new insights on the Stranger. \n\nhttp://strw.rs/6018YGUUa\n299\n710\n3.1K\n638K",
        "Lucas Star Wars Girl\n@LucasSWGirl\n·\nAug 23\nNot only is The Acolyte Season 2 cancelled, but Season 1 could be deleted as a tax write off.\n\nYou can't make this shit up \n1.4K\n843\n11K\n394K",
        "The Star Wars Underworld\n@TheSWU\n·\nJul 11\nSeeing a Wookiee Jedi go ham in live-action has gotta be a top 10 Star Wars moment of the decade. #TheAcolyte\n340\n518\n5.9K\n316K",
        "No Time To Dan\n@Danburden1138\n·\nSep 9\nIt's good that they got these Acolyte figures out so promptly in line with the show being out, and didn't wait to release them until the show was unceremoniously cancelled...\n\n... Wait\n1\n1\n8\n738",
        "Endymion\n@EndymionYT\n·\nJun 11\nThe third episode of STAR WARS THE ACOLYTE basically ruins the original films with all the creative decisions made within this one 44 minute episode. \n\nAnakin is no longer special, The Force can be whatever you want & lesbians can give birth to twins without the need of men. New\nShow more\n1.9K\n2.9K\n35K\n4.8M",
        "Shaun Arnold \n@badwulf1865\n·\nJun 22\nHello Friends!! It's podcast time again and we continue to look into Star Wars: Acolyte and all the controversy surrounding it. Plus the actors behind the masks. So, don't wait, head on over and check it out! Thank you!!🤓\n\nyoutube.com\nEpisode 70 - Behind the Mask Exclusive: Star Wars: The Acolyte...\n\n#acolyte #disney #scifi #starwars #wookieepedia",
        "The Block Party \n@BlockPartyFun\n·\nAug 30\nAmandla Stenburg's recent rant about the cancelation of Star Wars's The Acolyte series sparks controversy and debate as she blames the fans!? #TheAcolyte #starwarsfan #StarWars #Disney #LaborDayWeekend\n\nyoutube.com\nAmandla Stenburg Blames Fans for The Acolyte Being Canceled AGAIN! |... \n\nAmandla Stenburg goes on a rant on why she thinks The Acolyte was canceled and guess what? She's blaming the fans!BP Fun Links ⏩ https://www.bpfun.live/Cpt.",
        "RG | MythoByte \n@MythoByte\n·\nMay 19\nExploring the Controversy Surrounding the Lightwhip in Star Wars: The Acolyte Trailer\n\nhttps://mythobyte.com/exploring-the-controversy-surrounding-the-lightwhip-in-star-wars-the-acolyte-trailer/ \n\n#Action #Combat #Comic #Community\n\nmythobyte.com\nExploring the Controversy Surrounding the Lightwhip in Star Wars: The Acolyte Trailer\n\nThe release of the Star Wars: The Acolyte trailer has sparked a heated debate within the fandom regarding introducing the lightwhip, a modified lightsaber. While some fans are excited about this u…",
        "Geekville Radio \n@GeekvilleRadio\n·\nMar 30\nGeekville Radio #354: Acolyte Trailer Controversy, Bad Batch and X-Men '97 Reviews\n\n#StarWars #TheAcolyte #TheBadBatch #XMen97\n\nhttps://geekvilleradio.com/geekville-radio-354-acolyte-expectations-x-men-week-2-bad-batch-s3e09/\n\nvia @GeekvilleRadio\n\ngeekvilleradio.com\nGeekville Radio #354: Acolyte Trailer Controversy, Bad Batch and X-Men '97 Reviews\n\n#StarWars... \n\nThe Acolyte trailer has generated controversy. Plus we look at this week's episodes of The bad Batch and X-Men '97.",
        "𐐚r̷̞̹͔͌̾͝e̴̠͕̓̋ş̸̿͆h̴̗̺̃̏͑v̵͕̓̀͒í̵͓́c̶̨͓̳̍̊ \n@Breshvic\n·\nJun 24\n‘The Acolyte’ Episode 4 Discourse Proves How Ridiculous the ‘Controversy’ Is Getting\n\nhttps://reportultra.com/quanghuy/the-acolyte-episode-4-discourse-proves-how-ridiculous-the-controversy-is-getting/",
        "The Khaleesi of Fandom🟧 \n@rowina_blx\n·\nJun 23\nStar Wars Theory has completely lost his mind over Wookiepedia and The Acolyte, neither of which affect his life in any way. If you're gonna be critical be like @ReelShiftJoe or Jeremy Jahns. The Acolyte isn't even worth all this 'controversy' It's such a mid show 😭",
        "Slyth 🎬 \n@slythwalker_28\n·\nJun 20\n#IStandWithWookieepedia obviously. This controversy is just artificial, a cover for unfortunately thousands of people whose disgusting misogyny, racism, homophobia is discharged into The Acolyte and other Star Wars media. They’re no real fans, just despicable haters",
        "Russ Smith \n@MUGGER2023\n·\nJul 29\nNew @powellmajors : The rise of Kamala Harris and the conservatve controversy around The Acolyte.\n\nsplicetoday.com\n\nPlanet Kamala\nThe rise of Kamala Harris and the conservatve controversy around The Acolyte.",
        "Belinda \n@bellaella7\n·\nJun 15\n‘The Acolyte’ Episode 3 Controversy, Explained via @forbes\n\nhttps://forbes.com/sites/danidiplacido/2024/06/13/the-acolyte-episode-3-controversy-explained/",
        "TMB_TTLG_TMW777 \n@TTmw777\n·\nApr 2\nAcolyte Controversy - Forbes Journalist Gets DESTROYED\n\nhttps://youtu.be/kqbmjeZdCV8?si=4tg5eVvu5esJ3cab\n\nvia @YouTube\n\nyoutube.com\nAcolyte Controversy - Forbes Journalist Gets DESTROYED \n\nTHEORY SABERS - https://theorysabers.com/SPOTIFY Daily Podcast Episodes - https://sptfy.com/OQ45Apple Podcasts Star Wars Theory - https://apple.co/3Z0qBQETwi...",
        "HalfTangible \n@HalfTangible\n·\nJun 9\nDidn't we just recently have a controversy about the Acolyte being the gayest Star Wars has ever been? Or am I thinking of another project?",
        "Jay 🏳️‍🌈🍉 \n@The_Jay_Agenda_\n·\nJun 7\nAm I missing something? What ‘gay shit’?? Disney almost never does anything gay other than VERY brief mentions or mild implications",
        "C1D🏴‍☠️ \n@ceredirond80\n·\nAug 1\nHey my SW Peeps, I just loaded up GoH and this is a new event, I didn't watch acolyte, too much hype, controversy, political bs, it's not why I watch SW, I watch it to bring me back some hope, But I ask, or point out Is Death Trooper Moff Gideon a spoiler for Ashoka S2? Or what? \n\nContent warning: Sensitive content\n\nThe author labeled this post as containing sensitive content.",
        "Binary Sunset Media 🎬🎥 Movie/Television Studio \n@BinarySunMedia\n·\nJun 28\nAmandla Stenberg vs. Star Wars Fans: My Take on the Controversy\n\nhttps://youtube.com/shorts/ZDZ4Jm-N9FU?si=eNtcPN3XbsaAiSGg \n\nvia #FridayNightTights #Acolyte",
        "Han Solo scoundrel for hire\n@nerfherder76\n·\nSep 10\n\"BuT yOu'Re JuSt MaD AcOlYtE gOt CaNcElLEd\" No, it's disgusting shit like this. This situation is much bigger than the acolyte. if this doesn't offend you, wtf is wrong with you ! No human should be spoke about in this manner.\n0\n0\n0\n0",
        "Actual Fandom\n@fandom_actual\n·\nSep 9\nTwo of the people that were called out for hateful content last week, who are now redirecting hate at Star Wars Explained, are in this discussion. Only 2 of these people had seen the episode they discuss. But please, Gary, Ryan - tell us how you only spread happiness and love.\n0\n0\n0\n0",
        "𝙰𝙻𝙸\n@SEKIROx7\n·\nJul 19\n#The_Acolyte WTF 🔥🔥\n0\n0\n0\n0",
        "Raphael (82-60)(0-1)\n@parker1997_\n·\nJul 16\nACOLYTE WTF???\n0\n0\n0\n0",
        "Hoist the black flag 🏴 (🌮/🌯)\n@danksinatra308\n·\nSep 11\nWtf, acolyte fans can't read, no one will buy this\n0\n0\n0\n0",
        "Star Wars Holocron\n@sw_holocron\n·\nSep 10\nFinal cover art for the upcoming novel THE ACOLYTE: WAYSEEKER The book, which is available May 6, 2025, will continue the legacy of The Acolyte after the show’s cancelation with a new story about Vernestra Rwoh and Indara\n0\n0\n0\n0",
        "aima ⟶ (commissions open!)\n@aima015\n·\nAug 19\nthe acolyte cancelled wtf......\n0\n0\n0\n0",
        "Lord Yord\n@MrBrecken\n·\nAug 21\nWas about to watch The Acolyte but my screen was taken over by a pop up of Kathleen Kennedy who then turned off my television. 😭 WTF they doin\n0\n0\n0\n0",
        "Spooky Luna C. 🏳️‍⚧️ cw Kamen Rider Agito\n@fuyunoluna\n·\nAug 27\nokay but the acolyte actually slaps wtf\n0\n0\n0\n0",
        "asha\n@qyanagula\n·\nAug 19\nnot this tweet being how i discovered acolyte is cancelled wtf\n0\n0\n0\n0",
        "𝓔𝓶 💫\n@emkenobi\n·\nAug 19\nFans ask for Kenobi S2 Cancelled Fans ask for Book of Boba Fett S2 Cancelled Fans ask for The Acolyte S2 Cancelled Meanwhile Ahsoka is immediately greenlit for a S2\n0\n0\n0\n0",
        "kale • renew the acolyte era\n@cursedoracles\n·\nSep 9\nwhy is one of taylor’s best songs ever only 2 minutes and 26 seconds long wtf\n0\n0\n0\n0",
        "Theta\n@theta7274\n·\nJul 14\nYALL THE ACOLYTE IS PEAK WTF EPISODE 5 HOLY SHIT MAN\n0\n0\n0\n0",
        "moe\n@syz_1\n·\nAug 9\nMandalorian and Andor s2, we deserve this bcos wtf is Acolyte\n0\n0\n0\n0",
        "Yack\n@thatboyyack\n·\nJul 16\nWtf @starwars Acolyte\n0\n0\n0\n0",
        "Gvzv 🇯🇲\n@NxggaintheMist2\n·\nJul 16\nIdk who lied but the acolyte is fuego wtf especially this recent episode holyshit\n0\n0\n0\n0",
        "manny jacinto daily\n@mjacintodaily\n·\nAug 12\nHe's so huge wtf\n0\n0\n0\n0",
        "Dyl Atreides\n@SwordSaintDyl\n·\nAug 19\nThe Acolyte was so good Wtf is going on over there\n0\n0\n0\n0",
        "manny jacinto daily\n@mjacintodaily\n·\nAug 10\nThank God they chose the helmet wtf is that lmaoooo I'm scared\n0\n0\n0\n0",
        "Star Wars\n@starwars\n·\nAug 10\nReplying to @starwars Before the iconic helmet... here's a first look at concept art for the Stranger. #TheAcolyte\n0\n0\n0\n0",
        "OPM Aficionado\n@MrBlackCollar\n·\nJul 8\nThe Acolyte been good so far. Wtf was yall complaining about?\n0\n0\n0\n0",
        "emma 💖 acolyte era\n@ahsokandor\n·\nAug 20\nposted this then they cancelled the acolyte wtf\n0\n0\n0\n0",
        "emma 💖 acolyte era\n@ahsokandor\n·\nAug 19\ni hope manny jacinto is having the best birthday ever like the king he is #HappyBDayManny #RenewTheAcolyte\n0\n0\n0\n0",
        "jacob.\n@jtimsuggs\n·\nSep 11\nWhether you love or loathe The Acolyte, there’s no denying that this is still one of the coolest things to ever happen in Star Wars\n0\n0\n0\n0",
        "Zaki Hasan\n@zakiscorner\n·\nJun 24\nThe Acolyte has more user reviews after 4 episodes than 3 whole seasons of The Mandalorian, and more than Obi-Wan, Andor, Ahsoka, and Boba Fett combined. That’s in no way an organic metric of actual audience sentiment.\n0\n0\n0\n0",
        "Joanna Robinson\n@jowrotethis\n·\nAug 19\nI HATE THIS. Leslye Headland, the first woman to create a Star Wars series, tapped into something fresh and exciting in the fandom with S1 and while I had my notes she absolutely deserved a second season to let those ideas cook. We all lose with this. From deadline.com\n0\n0\n0\n0",
        "LeaAcolytes\n@RynHalo3000\n·\nAug 23\nHaters of acolyte: We have our opinions we can hate a show. Acolyte lovers: OMG WE LOVE THE ACOLYTE! Haters Of Acolyte: ew the show show sucks you guys are into terrible shows thats why it got cancelled. What happened to we have our opinions?? #RenewTheAcolyte",
        "Someone’s failed-clone’s daughter/granddaughter\n@MarienneMaid\n·\nJul 18\nThe press run of Acolyte is NIGHT AND DAY to what we got with the st, I want raises all around. Just saying it’s a romance. Just saying the ship name. Not being scared of loser fanboys on YouTube that were going to hate it all anyway. I cannot believe this is my life.",
        "Entertainment Weekly\n@EW\n·\nJul 18\n'The Acolyte' star Manny Jacinto addresses the Stranger and Osha romance, and says the big hand-holding finale scene was a last-minute change. https://ew.com/the-acolyte-finale-manny-jacinto-stranger-osha-romance-8679976?taid=669970c149ddfd0001c57146&utm_campaign=entertainmentweekly_entertainmentweekly&utm_content=new&utm_medium=social&utm_source=twitter.com",
        "SMSam🏳️‍🌈🇵🇸\n@SuperMutantSam1\n·\nAug 21\nreview bombing got so bad that a completely unrelated movie also called “Acolyte” started getting flamed on rating sites, you can’t make this argument when it’s one of the most extremely obvious examples of bad faith dogpiling in years https://x.com/thegroovygee/s/thegroovygee/status/1826419060663611694",
        "Ana R\n@BadCodeShoot\n·\nAug 29\nBeing a Star Wars fan is so annoying bc Hollywood only lets POC/gay ppl in the projects if they’re all gonna die or be evil. So acolyte got review bombed to hell by bigots & now has to be defended but it’s yet another project where the POC/gays are all evil or dead 🫠",
        "WWAC\n@wwacomics\n·\nSep 10\nREVIEW: The Acolyte Was the Devastatingly Clever Spark That Star Wars Needed From womenwriteaboutcomics.com",
        "DiscussingFilm\n@DiscussingFilm\n·\nJul 3\nLeslye Headland reacts to ‘THE ACOLYTE’ being review-bombed: “I was like, ‘Does anybody take that seriously anymore?’ I understand the point of it, which is that the average viewer would look at the site and say, ‘Oh, the user review is really low.’ But I think that, if you're",
        "Trey\n@Trey_Mitchell3\n·\nAug 30\nThe Acolyte was review-bombed months before it even aired. Hmm, I wonder why????",
        "alex ☠️\n@maulfisto\n·\nAug 28\namandla stenberg posted a 10-min story on instagram of their well-spoken thoughts on not only how grateful they are for the acolyte but also the hate against it. we love you amandla 🫶🏻 (1/2)",
        "DR_STEELERS\n@TheSteelDoc\n·\nSep 9\nScotty here’s my issue. The Acolyte wasn’t hated because of diversity. StarWarsTheory is outted for having a valid opinion. We hate these new projects if it means they provide garbage. We review bomb because we want change. The Acolyte should be lore first and diversity second.",
        "Scotty Holiday Star Wars 💫🏳️‍🌈\n@ScottyHolidaySW\n·\nSep 9\nUnlike other Star Wars 'creators,' I don't want to hate the thing that I love. One of my favorite parts about the Star Wars fandom is how it has the power to surround & connect us together; much like the Force itself ✨ Some people have clearly lost sight of that. #StarWars",
        "Jared Gooch\n@OkinawanCowboy\n·\nSep 3\nBest review #Acolyte #RenewTheAcolyte",
        "angie🐻🤎 #free🇵🇸🇸🇩🇨🇩\n@barriswestallen\n·\nSep 2\nLiteral one of the best explanations for why The Acolyte was so important and how its story was impactful to understanding Star Wars #RenewTheAcolyte #AcolyteS2",
        "anabelle // skeleton crew era 🪐\n@anabelle_dawn\n·\nAug 19\nThe people behind the 'bad acting' and 'bad writing' of The Acolyte: Leslye Headland- Russian Doll Dafne Keen- Logan, His Dark Materials Lee Jung-jae- Squid Game Carrie Ann Moss- The Matrix Amandla Stenberg- The Hate U Give Multiple award nominations/wins for each of them.",
        "Stoned Star Wars\n@StonedStarWars\n·\nSep 4\nThe 'real fans' didn't understand The Acolyte or even give it chance because they hate the gays. If Tarantino wrote a Star Wars story with Lesbian Space Witches the DudeBro's would lap it up. But a queer icon? They shut that shit down. It breaks my heart.",
        "Joanna Robinson\n@jowrotethis\n·\nAug 19\nI HATE THIS. Leslye Headland, the first woman to create a Star Wars series, tapped into something fresh and exciting in the fandom with S1 and while I had my notes she absolutely deserved a second season to let those ideas cook. We all lose with this. From deadline.com",
        "deacon || ceo of trilla-cal siblingism\n@trillasbitch\n·\n21h\nliterally. like you can hate on acolyte all you want, but the fights were incredible",
        "manny jacinto daily\n@mjacintodaily\n·\nSep 12\nThe fight scenes in the Acolyte are simply the coolest and badass af",
        "troy bond (grand admiral)\n@TroyHasEbola\n·\nAug 21\nI will never fucking forgive you nerds for robbing me of more Darth Plagueis screen time. The Acolyte wasn’t perfect and had some holes but so did (including the George Lucas ones) every Star Wars movie. Why do Star Wars nerds hate Star Wars so much man fuck y’all",
        "manny jacinto daily\n@mjacintodaily\n·\nAug 26\nDudebros and incels will do the same thing they did with Hayden Christensen Talk shit about it for the next 20 years and then in 2050 they'll be like 'Manny jacinto was the best, Qimir was so fuckin cool, man! The hate for the Acolyte was so forced! He's my favorite SW character'",
        "Sɪᴛʜ Eᴛᴇʀɴᴀʟ ♦\n@SithBase\n·\nAug 26\nManny Jacinto was my new favourite Sith. #RenewTheAcolyte #SaveTheAcolyte 🤲",
        "Darth Thunder ⚡\n@XDarthThunderX\n·\nSep 4\nRT if you hate bigots and want a S2 of The Acolyte ✨ #RenewTheAcolyte Artwork by @guiille__",
        "falka\n@mvdpire\n·\nSep 6\noh yeah please go on and tell me how the hate for the acolyte was only for the plot",
        "Hunter, Wrecker, Echo, Tech, Crosshair & The Kid\n@xCloneForce99\n·\n16h\nPeople really spend their whole life quoting Yoda’s 'hate leads to suffering' and then can’t contain themselves when the Acolyte is released 😂 #RenewTheAcolyte",
        "Kit, The Great Inferno\n@KitKatisWeird7\n·\nSep 10\nReplying to @KitKatisWeird7\nTbh, every move regarding Acolyte has been wrong. And I just don't buy it anymore.",
        "Chris Martinez\n@ChrisVMartinez\n·\nSep 9\nCanceling The Acolyte wasn’t a mistake. Giving it the green light in the first place was. It was utter trash.",
        "zay 🍃Kyoshi Thee Stallion 🍃🪨on twittеr\n@Indigofro\n·\nSep 8\nI’m sorry the acolyte is NOT the show you talk about for “bad lightsaber fights” that’s a straight up lie. You better thank them for what you might get in the future 😭",
        "NWF\n@THENWF\n·\nSep 11\nAcolyte was trash. Get over it. Casual fans didn’t care and it bombed. Maybe Star Wars and other companies should stop making content for the people who aren’t even fans. The ones crying for it are only doing so because it checked their boxes.",
        "Nerdist\n@nerdist\n·\nSep 8\nCancelling The Acolyte feels like a major Star Wars mistake https://nerdist.com/article/star-wars-the-acolyte-cancellation-is-a-mistake/",
        "Okiro\n@TheFirstOkiro\n·\nAug 20\nTwo truths can exist: The acolyte was an incredibly flawed show with frustrating creative choices. Lucasfilm struggles to do anything these days and Willow, Kenobi, TBOBF, and many other productions that could have been great suffer thanks to bad management.",
        "Nerd Cookies\n@nerd_cookies\n·\nJun 11\nWow... The writing in 'The Acolyte' is atrocious. This is the worst Disney Star Wars show by far and the bar was already subterranean.",
        "Nik Boyle\n@NikBoyle\n·\nSep 10\nThe Acolyte? Absolutely abysmal. Quite frankly, it’s the worst drivel Disney’s ever put out. How are they still being allowed to butcher the Star Wars 🤷",
        "Ian Miles Cheong\n@stillgray\n·\nJun 4\nThe Acolyte is “the gayest Star Wars yet.” Disney flushed the franchise down the toilet and now it’s deep inside a sewage pipe. From TheWrap",
        "Big Michael\n@BigMike23248\n·\nSep 10\nWrong! The idea and plot was there but the writing sucked ass, let alone the execution. Just let the Acolyte die so other cool shit can come about.",
        "Sawyer Loves Star Wars 💜\n@sawyeurism\n·\nSep 10\nI don't know who needs to hear this, but low viewership has nothing to do with the quality of a project and everything to do with marketing and the cost of streaming services.",
        "Rob Judge\n@DateHotter\n·\nSep 8\nReplying to @finstanner\nNEWSFLASH: Acolyte sucked ass! Numbers don’t lie toots. All the space chanting in the world couldn’t help ya stupid show. The power of…ONE season. Canceled! Sorted!",
        "Physical Media\n@PhysicalMedia_\n·\nJun 14\nAcolyte is the worst user reviewed Star Wars property of all time.",
        "Jill/Jixel\n@Jill_Jixel\n·\nSep 9\nReplying to @sawyeurism\nfrom the hand full of clips that ive seen on youtube from The Acolyte it looks like shit…like how the fuck do bitches get pregnant by using the force 😂😂 the show is a joke.",
        "Rob Judge\n@DateHotter\n·\nSep 9\nReplying to @Scarletbitxh\nI need to remind you that the Acolyte sucks and it’s never getting a second season and it’s over and done with.",
        "Luke\n@_CaRtOoNz\n·\nJul 16\nAfter careful reconsideration and watching through to the end, I can honestly look back and say... The Acolyte is even worse in it's entirety than I could have ever imagined.",
        "Nerdrotic\n@Nerdrotics\n·\nJun 27\nWhy The Acolyte Sucks | Episode 5: The Best of the Worst Star Wars Ever Made #Acolyte New Video https://youtu.be/yyiXlDC3pxA?si=sUyETB5mIiw4FJZx via @YouTube",
        "OtakuVT\n@PsiChoChannel\n·\nSep 10\nIf by expanding you mean taking an old white mans franchise, then blatantly shitting on every story he's ever made with a single series, sure. Acolyte is canon breaking garbage, and anyone that is actually a fan, and have been for any length of time, could tell you that.",
        "jacob.\n@jtimsuggs\n·\nJan 19\nNobody has ever “ruined” Star Wars, they’ve all simply made it better by further expanding it with their own visions.",
        "DR_STEELERS\n@TheSteelDoc\n·\nSep 9\nScotty here’s my issue. The Acolyte wasn’t hated because of diversity. StarWarsTheory is outted for having a valid opinion. We hate these new projects if it means they provide garbage. We review bomb because we want change. The Acolyte should be lore first and diversity second.",
        "Scotty Holiday Star Wars 💫🏳️‍🌈\n@ScottyHolidaySW\n·\nSep 9\nUnlike other Star Wars 'creators,' I don't want to hate the thing that I love. One of my favorite parts about the Star Wars fandom is how it has the power to surround & connect us together; much like the Force itself ✨ Some people have clearly lost sight of that. #StarWars",
        "guy online\n@fellawhomstdve\n·\nJul 11\nI am The Acolyte’s biggest defender and yet when I inevitably post that the next Favreau/Filoni venture is garbage everyone will accuse me of being a reflexive hater for clout…",
        "Stoned Star Wars\n@StonedStarWars\n·\nAug 8\nI believe that if you honestly think that you believe The Acolyte is \"garbage\" then you either do not understand it or are believing what a YouTuber told you. It's one of these two things. Because it's staggeringly good. Whether you think it or not. It is. #RenewTheAcolyte",
        "Ryan Kinel - RK Outpost\n@KinelRyan\n·\nSep 4\nJust as a reminder, The Acolyte is a garbage show and deserved to be cancelled.",
        "Pancaked Brick, Fried by Koroks\n@FuckKoroks\n·\nJun 22\nReplying to @FuckKoroks\nI just watched The Acolyte episode 4, and it's REALLY bad. It felt like filler, which is incredible because the show is only 8 episodes long. People just fucked about in the woods and they killed the episode's main antagonist off-screen in an ignoble way. Actual garbage TV.",
        "Maw\n@TheEbonyMaw\n·\nAug 20\nYou misunderstand. The cancellation of The Acolyte is not really a victory for us. It’s the byproduct of the victory you guys won over Star Wars years ago. We are simply amused trolls dancing around the garbage fire that is your consequences. https://x.com/rocketmanakin//rocketmanakin/status/1825678247700607479",
        "Cosmic Book News\n@cosmicbooknews\n·\nJul 9\n#TheAcolyte Episode 7 Review: Complete Trash",
        "SlipdDisk\n@SlipdDisk\n·\nJul 27\nIt baffles me that Disney can approve Andor but then sign off on garbage like Book of Bobba Fett and The Acolyte. It's like there's no oversight so we get a huge spectrum of quality. Andor is a masterpiece. Probably the best show I've seen this year.",
        "Dizzy 🏈⚡️🎮\n@dizzy_huerta\n·\nJun 19\nI was really trying to keep an open mind and wait for the conclusion of the season, but the Acolyte is HOT garbage. I’m cool with taking a franchise and putting your own creative spin on it but the story, character development, acting, etc. are all terrible.",
        "Kay 🔜 TwitchCon SD 🌙\n@kayluckydog\n·\nJul 23\nThat AI garbage that StarWarsTheory ‘created’ is actually the worst thing I’ve ever seen in my life. Also, it was a preview he recorded on his phone for some reason?? YouTuber with zero rizz and zero talent to match, who somehow has the gall to hate on The Acolyte? Lmao yikes.",
        "Kunle\n@iddddsomn\n·\nJul 17\nImagine watching the fight scenes in Ep 5 and 8 and still say with a straight face the acolyte",
        "Jeremy Prime\n@DDayCobra\n·\nJul 10\nEpisode 7 of the Acolyte might be the single worst television I've ever seen. It's really unbelievable. Fuck this show. Fuck Lucasfilm.",
        "thatstarwarsgirl\n@thatstarwarsgrl\n·\nJun 24\nI have watched and filmed my review for The Acolyte Ep1. I lost so many braincells I need a break. This show is TERRIBLE! Anyone defending it is an absolute moron! Jfc🤦‍♀️",
        "Joshua Sexton\n@Zero2Mars\n·\nJul 20\nNot even close or even recognizable at all. Plus Cowboy Bebop is amazing while the Acolyte is a giant pile of garbage as the cool kids say.",
        "Bounding Into Comics\n@BoundingComics\n·\nJul 18\n‘The Acolyte’ Creator Leslye Headland Says Disney Star Wars Series Was “Tonally” Inspired By ‘Cowboy Bebop’ https://boundingintocomics.com/2024/07/19/the-acolyte-creator-leslye-headland-says-disney-star-wars-series-was-tonally-inspired-by-cowboy-bebop/",
        "Eliezer Rodriguez\n@Eliezer06685056\n·\nJun 19\nReplying to @SimonTalksSW\nSWT: Acolyte is hot Garbage. That Same Night: Acolyte Watch Party! What a joke.",
        "Cosmic Book News\n@cosmicbooknews\n·\nJul 9\nReplying to @cosmicbooknews\nEpisode 7 of The Acolyte is absolute trash full of useless garbage and is a complete waste of another episode. The story is forced and has zero progression, and the characters continue to act contrary to established lore. This episode should have easily been combined with Show more",
        "Travis Townsend\n@TravisT58631218\n·\nSep 9\nReplying to @howlingwolfjoey and @MinuteNerdNews\n'I didn't care for the Acolyte.' is an opinion. 'You're not a real SW fan, Acolyte is garbage and you are unbelievably dumb' is bullying, wouldn't you say?",
        "Shredder Snarf\n@ShredderSnarf\n·\nJun 19\nLegends lore doesn't apply here, this is Disney canon so there's no contradiction for all we know Disney buffed the Cerean lifespan, in terms of AGE there's no contradiction just to be clear. Acolyte is garbage but this is a weak point to linger on.",
        "MauLer\n@MauLer93\n·\nJun 19\nBro shouldn't even be alive for this scene and you are calling people grifters. x.com/retneysholocro…",
        "AzAlexzZ ⭐️⭐️⭐️⭐️ T1 2023 WORLD CHAMPIONS\n@AzAlexzZ\n·\nJun 15\nI just finished watching episode 3 of The Acolyte... This is completely insulting wtf is this woke ass garbage A complete mockery of what George Lucas established about how the force works and how everything is intertwined in the universe my goodness this is just complete bs.",
        "Stephen C. Thompson\n@PhenCSon\n·\nAug 20\nGreat thread but lost in all the outrage is the cost. They spent $22.5M per episode. What could you do with $2.5M in film production? Because it's not whatever the fuck that Kathleen Kennedy garbage was... Saw a point yesterday, Acolyte was just a money laundering scheme.",
        "Bad Whatever Takes\n@BadMediatake\n·\nAug 19\nAcolyte meltdown thread.",
        "Writer\n@summoner2100\n·\nJun 5\nOh, no it is not. Rob. Take your BS hatred of EVERYTHING somewhere else. Your 'takes' are complete garbage. If you think Acolyte misunderstands Star Wars, then YOU don't understand Star Wars. Take a hike, gatekeeper. https://x.com/RMBee/status/1/RMBee/status/1798218270664995098",
        "Tea Baggins\n@Mykool_Carknee\n·\nJul 3\nomg a women led series with gay characters getting good scores? almost like the Acolyte is just garbage writing with weird pandering, non-canon story lines, bad acting, and a director intent on projecting her sexuality on the audience.",
        "westerosies\n@westerosies\n·\nJul 3\n#HouseOfTheDragon Season 2, Episode 3, ‘The Burning Mill’ holds a 92% fresh Rotten Tomatoes rating based on 13 reviews 🐉🍅",
        "IZ Reloaded\n@izreloaded\n·\nJun 12\nReally wanted to give Star Wars Acolyte a chance after watching the first two episodes but this episode 3 is total garbage! Wtf did I just watched?!!!",
        "zay 🍃Kyoshi Thee Stallion 🍃🪨on twittеr\n@Indigofro\n·\nAug 20\nAndor got, 'I’m trying so hard to enjoy it. But I don’t care about the characters. I’m jealous if you enjoyed it.' But Acolyte gets, 'I don’t like the characters. It’s garbage. I don’t like it, you shouldn’t either.' What a shift. There is absolutely no grace. #RenewTheAcolyte",
        "SITHbabe #OshamirSTOCKHOLMBAE\n@OGPlaneteer\n·\nAug 20\nReplying to @OGPlaneteer\n***correction the second post was a duplicate image to another I’ve already remarked on this is the post I meant to attach**",
        "Patrik Sherman 🇪🇺🇨🇿\n@Patrig_Sherman\n·\nJun 15\nit’s actually incredible, this studio produced a gem like Andor yet the rest is utter garbage. Kenobi, Ahsoka, Acolyte..horrendous shit.",
        "John Talks\n@j_t_starwars\n·\nJun 14\nsixteeeeeeeeen perceeeeennnnnnt.",
        "Nerdrotic\n@Nerdrotics\n·\nJul 22\n🚨NEW VIDEO The Acolyte Season 1 Review - The Worst Star Wars Ever Made👇 🔥https://youtube.com/watch?v=N5qitWkHICc🔥",
        "Rob Judge\n@DateHotter\n·\nSep 8\nReplying to @sawyeurism\nOrrrrrr maybe it was just because the Acolyte was an absolute trash show with terrible writing and direction that warrants all the hate it gets 🤔",
        "Cap\n@Cap___17\n·\nAug 24\nFans aren’t going to watch a shitty product. They were getting absolutely KILLED on their social media platforms about how garbage the Acolyte was. Star Wars is dying if not dead already.",
        "Rolling Stone\n@RollingStone\n·\nAug 23\nCommentary: Can the Best of Star Wars Survive the Worst of Its Fans? Before Star Wars can have another successful show, some vocal parts of fandom have to reckon with what they really want out of the franchise. More: https://rollingstone.com/tv-movies/tv-movie-features/acolyte-canceled-star-wars-fandom-1235086713/"
    ],
    "Andor": [
        "Lalo  SHŌGUN SWEEP\n@clonehumor\n·\nJul 12, 2023\nThe entire Andor cast, who gave some of the best performances in Star Wars and television in general ever, got a total of ZERO Emmy nominations..\n333\n1.8K\n17K\n898K",
        "Hashmojis\n@hashmojis\n·\nSep 21, 2022\nIt's #Andor Time (US)\n435\n729\n72K",
        "helaena Snow\n@ryummmm21\n·\nSep 7\nI swear to God they all better survive however many seasons andor has left\n2\n2\n12\n513",
        "DiscussingFilm\n@DiscussingFilm\n·\nAug 9\nBen Mendelsohn will officially return as Krennic in ‘ANDOR’ Season 2.\n\nReleasing in 2025.\n228\n2.5K\n25K\n1.9M",
        "Nick Horowitz\n@ztiworoh\n·\nNov 2, 2022\nI find it very funny that the $5000 Star Wars hotel looks way more reminiscent of the dystopian prison in Andor than anything else in Star Wars\n220\n4.5K\n58K",
        "Eliu\n@noknewworld\n·\nSep 9\n“I’ll crush this whole tunnel.”\nCthoni Andor, Ch. 99\n#GACHIAKUTA #ガチアクタ\n2\n23\n94\n2K",
        "Nonexistent(kevin)\n@leroshe288072\n·\nSep 6\nOkey thanks Disney plus the moment I wanna watch andor you are not loading just great\n1\n9\n482",
        "✦ Joss ✦\n@tauntaunsoup\n·\nSep 8\nAndor concept art by Peter McKinstry\nAndor | A Star Wars Original Series\n1\n11\n222",
        "Eleanor Mueller \n@TheLetterbomber\n·\nNov 23, 2023\nfun fact: Andor ended my marriage\nQuote\nStar Wars Holocron\n@sw_holocron\n·\nNov 23, 2023\nThe finale of ANDOR Season 1 premiered on this day last year. What an incredible episode.\n391\n2.2K\n61K\n13M",
        "Gamer's JoyRide\n@Gamers_JoyRide · Aug 21\nAndor was 'brilliant writing', had way more amazing female character with a non-white male as lead, no? These Acolyte (& Weinstein's acolyte's) 'fans' totally DO NOT understand quality, do they? 😂",
        "venus 🍉\n@BRISSYBIEBS · Aug 28\nguys i just finished watching andor for the first time, that was so amazing holy shit",
        "Catherine Kneen\n@catherine_kneen · Aug 10\nI hope everyone connected to Andor knows how much I love Andor. Thank you Diego Luna for being such an amazing ambassador for Star Wars and for bringing Cassian to life!",
        "Andor News\n@newsandor · Aug 10\nDiego Luna on the fan response to #Andor 💞 🔗: https://instagram.com/reel/C-fkz0tsX-H/?igsh=ZjA1Y2x0eHhxbTk4",
        "Tom thailand enemies of tom holland. 🌹\n@ParkourjaguarF · Aug 22\nAndor look amazing and skeleton crew trailer having an amazing production. Look like a movie. Judge by the trailer. On episode of Ahsoka with thrawn arrival. Taika episode form Mando seaosn1. Lee isac Chung episode form mando season3 You see the pattern here.",
        "Lucy 🏳️‍⚧️\n@filmlovinglucy · Aug 21\nCan Star Wars look this good again please ?? x.com/SCentralized/s…",
        "nahh-Baron, Dade-Rautha\n@Hozay_ · Aug 30\nRewatching #Andor and Jesus Christ, the ending of Episode 3 got me emotional. Wow. I forgot how amazing this show was.",
        "comicisky ⚡️\n@comicisky · Jul 16\nAndor and the first two seasons of The Mandalorian are amazing. I have gripes with literally everything else on this. Especially Ahsoka cause she’s my fav. The show/ story was boring… Obi Wan shouldn’t have introduced baby Leia. I said what I said. Should’ve been Luke.",
        "homotron 3000\n@kaIasbra\n·\nSep 9\nandor ref in da gay wizard fanfic\n4\n142",
        "LaughingPlace.com\n@laughing_place\n·\nSep 13\nReplying to \n@laughing_place\n and \n@Hasbro\nDedra Meero from #Andor coming to the Vintage Collection. #HasbroPulseCon2024 #StarWars\nHasbro\n1\n1\n4\n519",
        "Star Wars Holocron\n@sw_holocron\n·\nSep 5\nDisney/Lucasfilm are reportedly reducing their output of live-action Star Wars shows on Disney+ to 1 per year starting in 2025.\n\nIn comparison, 2022 featured 3 live-action Star Wars shows (The Book of Boba Fett, Obi-Wan Kenobi, & Andor)\n267\n359\n1.5K\n282K",
        "lexs\n@jynncassian\n·\n1h\ni genuinely think that no man looked this good before diego luna as cassian andor in rogue one happened\nFrom \nkaytuesso\n1\n8\n152",
        "kaytuesso\n@jeronandor\n·\nSep 8\nthis is the only existing shot of rodma maddel in rogue one but surely that'll change when cassian recruits her to the rebel alliance in andor season 2\n3\n49\n977",
        "Taylor (Disney World Leash Kid)\n@TaylorDherty\n·\nSep 8\nWatching my physical copy of ANDOR because I respect the arts!\n4\n118",
        "I need a better user name\n@Maarva_Andor\n·\nSep 9\nShot and chaser\n2\n85",
        "Ty\n@TyBecool1138\n·\nSep 8\nWatching   #Andor #4K\n2\n41",
        "Jupiter\n@fakeapparition\n·\nSep 5\nthis happens to Andor in the show Andor\nQuote\n1HoodPower\n@1HoodPower\n·\nSep 3\nChannel 11 learned a 13-year-old girl from Pittsburgh who was missing for the past month has been behind bars in the Beaver County Jail for the past 2 weeks. The Beaver County District Attorney Nate Bible said she ended up here because she lied to police. https://wpxi.com/news/local/missing-pittsburgh-teen-located-beaver-county-jail-using-different-name/D3SIXN74P5DM7OLWEFQVQDOB7E/…\n2\n1\n15\n679",
        "RWI Leibniz Institute\n@RWI_Leibniz_en\n·\nSep 11\nReplying to \n@RWI_Leibniz_en\nJohn List with RWI President Christoph M. Schmidt and Mark A. Andor, Co-Head of the Research Department ‘Environment and Resources’ at RWI.\n1\n1\n7\n3K",
        "No Time To Dan\n@Danburden1138\n·\nSep 9\nIt's good that they got these Acolyte figures out so promptly in line with the show being out, and didn't wait to release them until the show was unceremoniously cancelled...\n\n... Wait\n1\n1\n8\n738",
        "Endymion\n@EndymionYT\n·\nJun 11\nThe third episode of STAR WARS THE ACOLYTE basically ruins the original films with all the creative decisions made within this one 44 minute episode. \n\nAnakin is no longer special, The Force can be whatever you want & lesbians can give birth to twins without the need of men. New\nShow more\n1.9K\n2.9K\n35K\n4.8M",
        "Shaun Arnold \n@badwulf1865\n·\nJun 22\nHello Friends!! It's podcast time again and we continue to look into Star Wars: Acolyte and all the controversy surrounding it. Plus the actors behind the masks. So, don't wait, head on over and check it out! Thank you!!🤓\n\nyoutube.com\nEpisode 70 - Behind the Mask Exclusive: Star Wars: The Acolyte...\n\n#acolyte #disney #scifi #starwars #wookieepedia",
        "@starrymm426 · Aug 29\nOur Queen has amazing taste @rosariodawson Mandalorian: Rosario Dawson praises Pedro Pascal's performance in Season 2 finale\nFrom dorksideoftheforce.com",
        "Indoraptor Productions\n@MrIndoraptor54 · Sep 5\nAll that potential only to be completely undone in Mandalorian season 2.5 and then they're back together in season 3. Like I'm still so upset about that.",
        "MaceAhWindu\n@MaceAhWindu · Sep 5\nImagine that was the last time they saw each other holy shit\nx.com/starwarsbean/s…",
        "Eric Mrozek\n@EricMMrozek · Sep 6\n- Andor and The Mandalorian are great.\n- Ahsoka's first four episodes are a mess, but it got better.\n- The Book of Boba Fett made the stupid mistake of doing housekeeping for The Mandalorian by airing the first two episodes of Season 3.\n- The Acolyte is a disaster. #StarWars",
        "Always Sunny On Scarif\n@ScarifPodcast · Sep 6\nWhat worked? What didn’t? What has been your personal favorite? #StarWars",
        "Ember loves Shin\n@Spectre__Two__ · Aug 28\nHere’s your QOTD: what was your favorite episode from The Mandalorian Season 3 and why? I enjoy them all but I think my answer is “The Spies”- my favorite part is Din’s pledge, but I also loved seeing a bunch of Mandalorians get together and take their planet back",
        "Mandalorian Believer\n@MandoBeliever · Aug 28\nThe Mandalorian season 4, please? #themandalorian #dindjarin #grogu #bokatankryze #starwars",
        "Star Wars Holocron\n@sw_holocron · Aug 26\nSeveral unannounced Star Wars shows are currently in development at Lucasfilm (Source: https://theinsneider.com/p/acolyte-canceled-inside-story-future-lucasfilm-keanu-reeves-nearly-played-sol-kathleen-kennedy)",
        "Comic Basics\n@comic_basics · Aug 30\nWhat’s Happening with ‘The Mandalorian’ Season 4? https://comicbasics.com/whats-happening-with-the-mandalorian-season-4/",
        "Ian (Rams Up Pod)\n@_mandalorian27 ·",
        "Cal\n@wyattyhalpert · 16h\nJust heard Penguin referred to as \"the Batman version of Andor\" and a clip of Grace Randolph complaining there are no easter eggs in it. We're so back",
        "Matthew “Movies” Thomason\n@ThomasonTown · Sep 6\nThe category is: “Cool guys who teach our character fundamental lessons about their philosophy which will ultimately have a profound impact not only on their transformation as a character but also thematically on the story itself.” (Yes I’m saying that Nemik is Andor’s Yoda.)",
        "kaytuesso\n@jeronandor · Sep 10\ncassian's observancy is something we know he has given that he's a spy in rogue one and we see it all throughout andor but i love how we're able to trace where he gets it from through glimpses of clem instilling it into him\n0:00 / 0:36",
        "yuuko from nichijou\n@headfallsoff · Sep 9\ni like how andor captured the post-industrial dystopia of imperial star wars by just shooting on location in the uk",
        "Iain\n@starwarsiain · 2h\nGettting to see the ISB in real detail in Andor was some of the best scenes in Star Wars in a long time. #StarWars #Andor",
        "kaytuesso\n@jeronandor · Sep 8\ni only travel by rogue one bus or andor taxi",
        "colton robertson\n@coro_BLooM · 23h\nthe overhead lighting in andor’s ISB room is just top notch production design, really brings the whole room together",
        "Jayden\n@just_jayd3n_ · Sep 12\nOutlaws Vs Andor ISB Conference Room Dan Entwistle",
        "garciansmith.bsky.social\n@Garcian_Smith · Sep 8\nahsoka winning an emmy while andor won none is my villain origin story",
        "DiscussingFilm\n@DiscussingFilm · Sep 8\n‘AHSOKA’ is now an Emmy-winning series. The series won the Emmy for Best Fantasy/Sci-Fi Costumes",
        "👻Frank Rodriguez 👻\n@F_Rodriguez__ · 2h\nReplying to\n@Boobafett69 and\n@Lionsgate\nThanks! I actually had my Andor 4k steelbook spine just rip halfway a few days ago. So I'll need to rebuy it. 😭",
        "Johan Terpstra\n@FCCoachJohan · 2h\nIs\n@Andor_F\nal flauwgevallen van z’n erectie? #azHEE",
        "Skales Sibbons\n@Skales20 · 2h\nWhat was that song playing at the end of Andor episode 7?",
        "Yonkykong\n@yonkykong · 2h\nReplying to\n@yonkykong\n\n@GoldenFoggy and\n@lupanthevodka\nPor cierto en el discord estan viendo Star Wars Andor por la noche.",
        "Solomon\n@SolomonJMart · Jun 6\nWow #theacolyte is unwatchable! An abomination and so bad it’s not even a funny bad. Disney has pretty much broke this avid @starwars fan’s heart. Andor show and Rouge One are the only good things they have made..",
        "d a n i 🦦\n@isthatyoudani · Jul 10\nAndor terminada y wow, pretty cool",
        "Ocho loves Coke Rap\n@OchoReacts · Mar 4\nAndor.. wow man this is what real television is about",
        "nahh-Baron, Dade-Rautha\n@Hozay_ · Aug 30\nRewatching #Andor and Jesus Christ, the ending of Episode 3 got me emotional. Wow. I forgot how amazing this show was.",
        "Ana R\n@BadCodeShoot · Feb 9\nAs I was watching Andor I was like wow, Israel really is the empire. Turns out these guys recognize they are the empire but just don’t think that’s bad, this is what happens when ppl continually hype up the villains w no critical awareness 😵‍💫",
        "Cas™\n@Casimir_MC · Sep 12, 2023\nHands down…THE best episode of all the live action shows. Yes better than THAT Andor episode. Wow #Ahsoka",
        "Charlie G\n@charliegftbl · Feb 5\nStarted Andor. Wow.",
        "James in-game\n@longtalljamesw · Apr 10\nLate to the party but Genevieve O’Reilly in Andor? Holy wow",
        "Adam Meilstrup\n@shinglestrup · Sep 15, 2023\nFinally finished Andor. Wow.",
        "SD-Cobalt\n@punished_cobalt · Nov 1, 2023\nSo you’re telling me She Hulk only cost 25 million less than Andor? WOW",
        "Tom Smith\n@mrtomsmith · Jul 7\nFinally watched #andor. Wow. So good. This is what I wish the prequels had been - politics and rebellion and fascism, written for adults.",
        "Bog Warrior 🇮🇪🇪🇺🇫🇷 🇵🇸\n@tim_tonky · Jul 26\nDecided to watch some of the Acolyte and wow andor really is the only good star wars media to come out in 20 years lol",
        "nat 🌿\n@aquariancity · Feb 19\nWow Andor really is the best tv show to ever come out of Disney…. even if you aren’t about Star Wars please give it a watch",
        "MicKy\n@DarthMicKyyy · Sep 9, 2023\ntypical star wars fans... ya'll really cant just say \"WOW Ahsoka is so good!\" It's gotta be \"WOW So much better than Mando and Andor and Kenobi BLAH BLAH BLAH\" You guys DO know you can praise one thing without tearing down another...right?",
        "T3N4L\n@T3N4L · Aug 12\nWow Finished Andor Ep 5 and 6 and all I can say is wow... can't believe the way episode 6 went, literally insane. Gives me some money heist vibes but in star wars and I'm a huge fan already, excited to see what's next visuals continue to look incredible in this show",
        "Loki Jarson\n@LokiJarson · Nov 25, 2023\nAndor, episode 10: Wow, you can make an interesting story AND put action in it! (so why don't you do that all of the time, Disney? Andor, Mando, Ahsoka, why is this so frigging hard?) The payoff for Kino was stupid. Too many flowery speeches by him and Luthien. Best episode.",
        "cami\n@ROCKSTARH0NG · Sep 9, 2023\nAhsoka is so good like?!? I genuinely couldn’t think any series could top Andor but wow",
        "redacted\n@dorkwingg · Feb 19\nLiterally every performance in Andor is peak. But wow this moment with Fiona Shaw is 🥺😩",
        "Noah\n@keldorjedii · Feb 19\nx.com/TheCinesthetic…",
        "Kaizer Pineapple\n@KaizerPineapple · Aug 20\nBoy, the wording #Disney used to try and hype the series have become a real eyebrow raising stat all the sudden. If #TheAcolyte really was the \"most viewed D+ series of 2024\", but it had only 50% less viewership than 'Andor'... Wow, that paints a depressing picture for Disney.",
        "Spicy memes\n@uncommonspice · Aug 18\nCongratulations to Amandla Stenberg, Leslye Headland, Kathleen Kennedy for making The Acolyte to be the biggest flop series ever #Acolyte #TheAcolyte",
        "Linkal_\n@Linkal_art · Jul 23\nI might be a little late to the party but I finally got around to watching Andor, and wow, it is pretty fire",
        "Mr. Bird\n@RamblerRowdy · Apr 9\nWow Andor is a masterpiece",
        "Filipe B.\n@filipe_db · Jun 13\nSabem aquela sensação de WOW num primeiro episódio de House of the Dragon, Fallout, The Last of Us... até em Andor, sei lá. Em #TheAcolyte tudo me parece sem graça, plástico, sem inspiração, como se aquela gente não se pudesse importar menos com o que está para ali a fazer. 😐",
        "John Pemble\n@johnpemble · Sep 26, 2023\nAhsoka. As good as Andor. Just wow. So wow.",
        "UnwhitewashTBB | #OshaViolations\n@Clonehub7567 · Mar 21\nAndor really has the best sound track out of all of star wars LA or animated like wow.....every time anything played it came in so beautifully and the different versions of the main theme or rix road or anything else were always composed so well.",
        "👑\n@insanistyles · Apr 28\nANDOR EPISODE 10 WOW",
        "matias\n@mattoncie · Dec 4, 2023\nestaba viendo el video de andor de drew gooden y creo que voy a quitarlo y verme andor porque wow",
        "Ally M. C-W ☽ ☾ 💖💜💙\n@nametags · Apr 6\nReplying to @BEVERLYSKILLS2 and @Maarva_Andor Wow just loud and wrong. There aren’t nearly as many detransitioners as y’all love to claim",
        "pum woterbug |🍬⛅| 💒 ☆\n@pumperbug · Apr 15\nwow Andor was a beautiful show that moved me to tears multiple times i sure hope its not an allegory for real things going on in real life",
        "T\n@knickswolves_04 · May 6\nhttps://theringer.com/star-wars/2022/11/2/23436692/andor-star-wars-disney-plus-episode-9-recap been slowly getting through andor lately n if you've watched it i would highly recommend reading this wow amazing insights theringer.com ‘Andor’ Episode 9 Breakdown: The Empire Is Scarier Without Sith Lords and Superweapons By avoiding Darth Vader, the Death Star, and the dark side of the Force, ‘Andor’ has foregrounded the disturbing banality of the Empire’s evil",
        "Tom\n@tomofshield · 2h\nReplying to\n@By_the_Charles\nAhsoka's tattoos in Andor just seems too crazy to be true",
        "By the Charles\n@By_the_Charles · 2h\nDo you think we will see the #Andor symbol in S2? The Fulcrum symbol? Thoughts?\n14 votes\n·\n1 day left",
        "Lindo Pulgoso\n@LindoPulgoso8 · 2h\nReplying to\n@antonlosada\nPues mira la serie Andor que es el inicio de la rebelión y ya nos cuentas",
        "JohnFCP\n@JohnFCP · 2h\nReplying to\n@ch0rabebe and\n@MauroXavier\nQuando é preciso, os padres estão sempre lá com o andor, impressionante.",
        "Arek\n@andor221 · 2h\nGdyby przez prawie rok robili co powinien Rząd to dziś ZPolscy nie przeżywali by dramatu powodziowego ale cóż jak zamyka się polskow w ramach zemsty to teraz są efekty",
        "Cassian Andor\n@benkenobi695 · 2h\nReplying to\n@UtdEIIis\nI say this with the most respect: shut the fuck up",
        "paulo azevedo\n@PauloAzevedo23 · 2h\nReplying to\n@oREIdoMercado1 and\n@SLBenfica\nFalta clara do Otamendi. E já contra o Moreirense foi um andor. O Benfica está a ser levado ao colo.",
        "Ben Watson - waspshot23.bsky.social\n@Waspshot23 · 2h\nDamn he's right. Stuff like Andor is good but it's no fun is it.",
        "DiscussingFilm\n@DiscussingFilm · 3h\nDonald Glover says he just wants his ‘LANDO’ movie to be fun.\n\n“As a Star Wars fan myself, I think it's important that there just needs to be more fun being had, it's very hard to have fun right now”\n\n(Source: https://youtu.be/B5N0vYOTMM4?si=CcOyqEtzVBZNWZ0Q)",
        "🇮🇹 Sal Scalici\n@CaesarsWolfpack · 2h\nHad the privilege of meeting the great Andy Serkis today. Super humble and nice guy. Won’t ever forget it\n\n#ApesTogetherStrong #Andor #KingKong #BlackPanther #Gollum #TheBatman",
        "𝐩𝐚𝐮𝐥\n@i_love_my_wive · 2h\nI just watched #ANDOR, myself. What a stunning achievement! Best SW since ROTJ.\n✅ Story telling\n✅ Directing / Cinematography\n✅ Characters\n✅ Music / Sound Design\n✅ Acting\n✅ Editing\n✅ VFX\n✅ Freaking Dialogue!\n✅ Intelligent (no cutesy BS)\n✅ Meticulously crafted all-around",
        "rob delaney\n@robdelaney · Aug 25\nA full 2 years late to ANDOR which is of course a sin since Tony Gilroy made it. As great as everyone says & I did NOT know that Ebon Moss-Bachrach is in it! So is Adria Arjona! Too much great supporting cast to mention honestly. & score by Nicholas Britell! Exciting for me.",
        "Charlie Foxkit\n@charliefoxkit · 10h\nReplying to @charliefoxkit => Corporatists also diluted down the content so much where it isn't enjoyable with few exceptions (the modern Dune movies, Rogue One and Andor, just to name a few). And in the case of sci-fi/-fantasy they chose yes-men and not ACTUAL genre writers to make good stories.",
        "Carlos\n@sharintaint · 12h\nReplying to @brodiewankenobi Disney needs to pull their weight. The Acolyte had no fan interest and Skeleton Crew is a kid's show. Even Ahsoka and Andor are quite niche. There's not enough interest to cover these shows. Disney hasn't made mainstream Star Wars in years so there isn't content to cover.",
        "Lucky Andor\n@Luckandor · 13h\nReplying to @everydaycrush1 Looking so adorable ❣️",
        "Andor\n@andorbonfire · 14h\nReplying to @elonmusk I think we'd better take care of planet earth. Humans can't live on mars so you are just waisting money for nothing.",
        "Cal\n@wyattyhalpert · 16h\nJust heard Penguin referred to as \"the Batman version of Andor\" and a clip of Grace Randolph complaining there are no easter eggs in it. We're so back",
        "Bufftat Junkie\n@BufftatJunkie · 17h\nReplying to @MaceAhWindu *slaps roof of Andor* You can fit so many seasons into 4 years hahaha",
        "⪩﹒𝓼𝐢𝐨𝐛𝒉͟𝒂͟𝒏 ꜝ\n@LINEAGEFATED · 19h\nReplying to @kenariborn http://dita.‹3 i just feel like i’m running in circles ?? idek how to describe it 😭 also i think the lack of fulfilling andor s2 news :/ been running on fumes for so long it’s not working anymore lmfao",
        "Reika Kazama 🏳️‍🌈🇯🇵🦋🐝👹 マーベル vs カプコンが帰ってきた！\n@kabukibutterfly · 20h\nI'm so glad she likes Rogue One as well. That was the only reason I even gave Andor a chance.",
        "Torey ✨\n@ActuallyTorey · 21h\nReplying to @Salya_al_Onir @dinzmeria and 2 others Jumping in here to say star wars andor is some of the best TV I've ever seen and also my favorite Star Wars media and I loveeee star wars. So if you ever get the inkling to watch it, it's sooo worth it.",
        "The Artbook Collector\n@theartbookguy · 22h\nReplying to @TheSpaceshipper True, but Ashoka, Andor and S3 of Mando didn't get books, I can only guess the numbers said it's not worth it. So Acolyte was a surprise announcement. If the book does get released, I'll be picking it up. Helps if they would promote the books too, but they release them to fail",
        "Andor\n@andor241 · 22h\nReplying to @Lidestywurld i get it’s paying homage to lil wayne but it’s so random and doesn’t fit cartis sense of originality",
        "CineSummary\n@cinesummary · 22h\nReplying to @cinesummary While \"Andor\" exemplifies strong narrative in the Star Wars realm, most shows recycle faces just to appease fan service. So let’s toast not just for Chewie, but for the bittersweet cycle of characters who can never truly rest.",
        "Phiil\n@PhiilKyrkar · 23h\nReplying to @TheSteelDoc No they dont you arrogant fucktard. the fandom is split onnthe Acolyte and as for Disney yeah theyve boned a few things up but they gave us The Mandolorian, and Andor.. so piss off and go circle jerk yer girlfriend SWT somewhere else.",
        "mr.Andor\n@jeff_rey_andoh · 23h\nHer: so I’m wearing a white dress for my cousin’s wedding this weekend\nMe: give me a thickkk description\nHer: why can’t you say a “detailed description” like a normal person ?",
        "GrievousGames\n@grievous129 · Sep 13\nTalking about Andor with parents, and just talking about just makes me love it so much more.",
        "andor 🦋\n@cptandor · Sep 13\nSo… who’s doing us a solid and getting pics of ~that scene with the guitar in HOMD? 👀🎸",
        "lexs\n@jynncassian · Sep 13\nandor 2 fantastic 4 daredevil born again all next year WE ARE GONNA EAT SO WELL",
        "Star Wars Meg\n@StarWarsMeg1 · Jul 5\nAs much as I love this idea, it would never happen. Disney and Lucasfilm making spin-offs about very niche little-known characters doesn’t make them 💰 and wouldn’t get the wider viewership. If Andor suffered low viewership (and that series was amazing), the same can be said",
        "Richard Hoeg\n@HoegLaw · Aug 6\nThat Andor 2 better be amazing.",
        "Neel\n@LewisTheSloth · Aug 1\nAndor has a fucking AMAZING soundtrack",
        "Heat55Haslem\n@Heat55Haslem · Aug 20\nRewatched Andor and, yep, still amazing.",
        "Star Wars Holocron\n@sw_holocron · Aug 15\nDiego Luna says ANDOR Season 2 will make ROGUE ONE feel like a different movie 'I think people watching Rogue One, after watching season 2, are going to see a different film. Everything will be signified differently knowing what had to happen for K-2 to be there. It's going to'",
        "Qimir, First Knight of Ren\n@CzerSalazar · Aug 8\nFirst and foremost, the actors bring the characters to life in such a way that makes you feel so much. Cassian Andor, Kino Loy, even Maarva are all such amazing characters. And what’s more, none of them are Force Sensitive so we the audience can relate that much more.",
        "SirSnipeyy\n@SirSnipeyy · Aug 22\nEvery scene from Andor wipes the floor with The Acolyte. It’s well acted, well written, and best of all, it has a story and message it’s actually trying to tell. It’s the Star Wars the fans so desperately want, but so many still haven’t seen it. Go watch Andor!!",
        "Brian Fehrle\n@BrianFehrle · Aug 23\nAndor was amazing. It's everything I've wanted in a star wars show.",
        "Boardwalk Times\n@BoardwalkTimes · Aug 9\nAn amazing behind the scenes look at ANDOR S2 was just shown. Ben Mendelssohn & Alan Tudyk join Season 2. #D23",
        "Churnobyl\n@TheJackomack · Aug 28\nSome of the best shows of recent memory IMO The Expanse: The Impossible Bar 3 Body Problem: Fkn Amazing Stranger Things: 80s Perfection Midnight Mass: Best of Flanagan Severance: 🧑‍🍳💋+🤯 Andor: What the rest of Disney Era strives for",
        "Okiro\n@TheFirstOkiro · Jul 5\nI miss Andor. I miss its writing, its acting…I miss its quality and how it raised the bar",
        "david drake\n@somanyshrimp · Aug 31\nReplying to @DanSoch Andor is amazing",
        "Simon Herden\n@vfxPleb · Aug 15\nOne of my favourite shots I’ve ever composited, with amazing environment work from Chris Ford, James Hodgart, and Shinya Onda. Very fun to bring Andor’s vision of Coruscant to life.",
        "Star Wars Gifs\n@onewiththegif · Aug 15\nAndor",
        "Flo ⁷ 🍊\n@iammetbh · Aug 20\ni watched andor, incredible amazing but nothing new in the universe srsly, like oh yeah rebles durin the empire… nothing i dont know. but the acolyte was fresh and a new era and new stories that are almost unknown for ppl who only watched the movies #SaveTheAcolyte",
        "Ryan\n@Sojo3601 · Aug 23\n1) The acolyte was not anywhere near the best of Star Wars 2) The Star Wars fan base is mostly nerdy men, so it’s bad practice to write stories that don’t cater to that demographic. That shouldn’t be a complicated concept. 3) Andor was amazing: that should be the standard",
        "The Finer Points Of Geek\n@FinerPointsGeek · Jul 8\nAndor was amazing. Definitely a highlight of the Disney era.",
        "Yulie\n@juliannna_x · Sep 3\nJust rewatched #Andor and man. What a beautifully written amazing show. Has nothing to do with lightsabers, it goes to show that some people actually know how to write Star Wars stories that are set aside from the main movie characters. Got me crying at work 😭😭😭"
    ]
}